In [2]:
import pandas as pd

df = pd.read_csv('ridership_small.csv')
df.head()

         date         station  ridership
0  2025-02-15    Foggy Bottom       1198
1  2025-01-03   Gallery Place       1254
2  2025-01-29    Metro Center       1147
3  2025-02-04  L'Enfant Plaza       1176
4  2025-02-08   Gallery Place       1184

In [7]:
# Convert date column to datetime objects
df['date'] = pd.to_datetime(df['date'])

# Remove exact duplicate rows
df = df.drop_duplicates()

In [11]:
ridership_by_station = (df.groupby('station')['ridership'].sum().sort_values(ascending = False).reset_index())
ridership_by_station

          station  ridership
0    Foggy Bottom     130494
1    Metro Center     128329
2   Gallery Place     120985
3   Union Station     109529
4  L'Enfant Plaza     106528

In [15]:
ridership_by_date = (df.groupby('date')['ridership']
      .sum()
      .reset_index()
      .sort_values('date')
)
ridership_by_date.head()

        date  ridership
0 2025-01-01       6005
1 2025-01-02      13192
2 2025-01-03      11904
3 2025-01-04      19236
4 2025-01-05       6105

In [18]:
ridership_by_station.to_csv('ridership_by_station.csv', index=False)
ridership_by_date.to_csv('ridership_by_date.csv', index=False)